labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
#include "stm32l1xx.h" 
#include "Settings.h" 
#include "Pinouts.h"
#include "Shortcodes.h"
#include "Variables.h"

#include "Functions.h"
#include "Conversions.h"

#include "HAL_SIM800C.h"
#include "LIB_SIM800C.h"

#ifdef LIB_SIM800C_H
  
#if(_USE_GSM==1)

HAL_SIM800C                     sim800c;
Sim80x_t                        Sim80x;

//osThreadId    Sim80xTaskHandle;       // RTOS
//osThreadId    Sim80xBuffTaskHandle;   // RTOS

/****************************************************************
*FUNCTION NAME:Init
*FUNCTION     :Initialisation
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::Init(void)  
{
  sim800c.gpioInit();
  sim800c.uartInit();
}

/****************************************************************
*FUNCTION NAME:test
*FUNCTION     :test codes
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::test(void)  
{
  char temp[30];
    
  bufferProcess();
  delay_ms(300);

  sim800c.sendAtCommand("ATE0\r\n", 200, 0);
  delay_ms(300);
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); // clear buffer
  
  
  sim800c.sendAtCommand("AT\r\n", 200, 0);
  delay_ms(300);
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); // clear buffer
  

//  sim800c.sendAtCommand("AT+GSN\r\n", 200, 0);
//  delay_ms(300);
//  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); // clear buffer

  
  //getIMEI(temp);
  //sim800c.writeString("AT\r\n");
    //sim800c.init(osprior);
  //getRingVol();  
}

/****************************************************************
*FUNCTION NAME:debugTerminal
*FUNCTION     :Prints response to terminal IO
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::debugTerminal(char *msg)
{
  #if (_SIM80X_DEBUG== 1 || _SIM80X_DEBUG==2)
     char      *strStart,*str1;

     strStart = (char*)&Sim80x.UsartRxBuffer[0];  
      str1 = strstr(strStart,"\r\nOK\r\n");

      if(str1!=NULL)
      {
        #if (_SIM80X_DEBUG==2)
          printf("\r\nAT Respone : %s",Sim80x.UsartRxBuffer);
        #endif
        printf("\r\n%s ---> OK\r\n", msg);
      }
      else
        printf("\r\n% ---> FAILED\r\n", msg);

  #endif
}


/****************************************************************
*FUNCTION NAME:startSim80xBuffTask
*FUNCTION     :startSim80xBuffTask
*INPUT        :argument;
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::startSim80xBuffTask(void const * argument)
{ 
  while(1)
  {
    //if( ((Sim80x.UsartRxIndex>4) && (HAL_GetTick()-Sim80x.UsartRxLastTime > 50)))
    {
      //Sim80x.BufferStartTime = HAL_GetTick();      
      bufferProcess();      
      //Sim80x.BufferExeTime = HAL_GetTick()-Sim80x.BufferStartTime;
    }
    delay_ms(10);
  }    
}

/****************************************************************
*FUNCTION NAME:BufferProcess
*FUNCTION     : 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::bufferProcess(void)
{
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  //##################################################
  //+++       Buffer Process
  //##################################################
  str1 = strstr(strStart,"\r\n+CREG:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,',');
    str1++;
    if(atoi(str1)==1)
      Sim80x.Status.RegisterdToNetwork=1;
    else
      Sim80x.Status.RegisterdToNetwork=0;
  }
  //##################################################
  str1 = strstr(strStart,"\r\nCall Ready\r\n");
  if(str1!=NULL)
    Sim80x.Status.CallReady=1;  
  //##################################################
  str1 = strstr(strStart,"\r\nSMS Ready\r\n");
  if(str1!=NULL)
    Sim80x.Status.SmsReady=1;  
  //##################################################
  str1 = strstr(strStart,"\r\n+COLP:");
  if(str1!=NULL)
  {
    Sim80x.Gsm.GsmVoiceStatus = GsmVoiceStatus_MyCallAnswerd;
  }  
  //##################################################
  str1 = strstr(strStart,"\r\n+CLIP:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,'"');
    str1++;
    str2 = strchr(str1,'"');
    strncpy(Sim80x.Gsm.CallerNumber,str1,str2-str1);
    Sim80x.Gsm.HaveNewCall=1;  
  }  
  //##################################################
  str1 = strstr(strStart,"\r\n+CSQ:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.Status.Signal = atoi(str1);      
  }
  //##################################################
  str1 = strstr(strStart,"\r\n+CBC:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    tmp_int32_t = atoi(str1);
    if(tmp_int32_t==0)
    {
      Sim80x.Status.BatteryCharging=0;
      Sim80x.Status.BatteryFull=0;
    }
    if(tmp_int32_t==1)
    {
      Sim80x.Status.BatteryCharging=1;
      Sim80x.Status.BatteryFull=0;
    }
    if(tmp_int32_t==2)
    {
      Sim80x.Status.BatteryCharging=0;
      Sim80x.Status.BatteryFull=1;
    }
    str1 = strchr(str1,',');
    str1++;
    Sim80x.Status.BatteryPercent = atoi(str1);
    str1 = strchr(str1,',');
    str1++;
    Sim80x.Status.BatteryVoltage = atof(str1)/1000;      
  }
  //##################################################
  str1 = strstr(strStart,"\r\nBUSY\r\n");
  if(str1!=NULL)
  {
    Sim80x.Gsm.GsmVoiceStatus=GsmVoiceStatus_ReturnBusy;
  }
  //##################################################
  str1 = strstr(strStart,"\r\nNO DIALTONE\r\n");
  if(str1!=NULL)
  {
    Sim80x.Gsm.GsmVoiceStatus=GsmVoiceStatus_ReturnNoDialTone;
  }
  //##################################################
  str1 = strstr(strStart,"\r\nNO CARRIER\r\n");
  if(str1!=NULL)
  {
    Sim80x.Gsm.GsmVoiceStatus=GsmVoiceStatus_ReturnNoCarrier;
  }
  //##################################################
  str1 = strstr(strStart,"\r\nNO ANSWER\r\n");
  if(str1!=NULL)
  {
    Sim80x.Gsm.GsmVoiceStatus=GsmVoiceStatus_ReturnNoAnswer;
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+CMGS:");
  if(str1!=NULL)
  {
    Sim80x.Gsm.MsgSent=1;
  }  
  //##################################################  
  str1 = strstr(strStart,"\r\n+CPMS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    str1++;
    if(*str1 == '"')
    {
      str1 = strchr(str1,',');
      str1++;
    }
    Sim80x.Gsm.MsgUsed = atoi(str1);
    str1 = strchr(str1,',');
    str1++;      
    Sim80x.Gsm.MsgCapacity = atoi(str1);
  }  
  //##################################################  
  str1 = strstr(strStart,"\r\n+CMGR:");
  if(str1!=NULL)
  {
    if(Sim80x.Gsm.MsgFormat == GsmMsgFormat_Text)
    {
      memset(Sim80x.Gsm.Msg,0,sizeof(Sim80x.Gsm.Msg));
      memset(Sim80x.Gsm.MsgDate,0,sizeof(Sim80x.Gsm.MsgDate));
      memset(Sim80x.Gsm.MsgNumber,0,sizeof(Sim80x.Gsm.MsgNumber));
      memset(Sim80x.Gsm.MsgTime,0,sizeof(Sim80x.Gsm.MsgTime));
      tmp_int32_t = sscanf(str1,"\r\n+CMGR: %*[^,],\"%[^\"]\",%*[^,],\"%[^,],%[^+-]%*d\"\r\n%[^\r]s\r\nOK\r\n",Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);      
      if(tmp_int32_t == 4)
        Sim80x.Gsm.MsgReadIsOK=1;
      else
        Sim80x.Gsm.MsgReadIsOK=0;
    }else if(Sim80x.Gsm.MsgFormat == GsmMsgFormat_PDU)
    {

      
