labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
    }    
  }
  //################################################## 
  str1 = strstr(strStart,"\r\n+CRSL:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.RingVol = atoi(str1);    
  }
  //################################################## 
  str1 = strstr(strStart,"\r\n+CLVL:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.LoadVol = atoi(str1);    
  }
  //################################################## 
  str1 = strstr(strStart,"\r\n+CMTI:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,',');
    str1++;
    for(uint8_t i=0 ;i<sizeof(Sim80x.Gsm.HaveNewMsg) ; i++)
    {
      if(Sim80x.Gsm.HaveNewMsg[i]==0)
      {
        Sim80x.Gsm.HaveNewMsg[i] = atoi(str1);    
        break;
      }
    }
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+CSCA:");
  if(str1!=NULL)
  {
    memset(Sim80x.Gsm.MsgServiceNumber,0,sizeof(Sim80x.Gsm.MsgServiceNumber));
    str1 = strchr(str1,'"');
    str1++;
    str2 = strchr(str1,'"');
    strncpy(Sim80x.Gsm.MsgServiceNumber,str1,str2-str1);
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+CSMP:");
  if(str1!=NULL)
  {
    tmp_int32_t = sscanf(str1,"\r\n+CSMP: %hhd,%hhd,%hhd,%hhd\r\nOK\r\n",&Sim80x.Gsm.MsgTextModeParameterFo,&Sim80x.Gsm.MsgTextModeParameterVp,&Sim80x.Gsm.MsgTextModeParameterPid,&Sim80x.Gsm.MsgTextModeParameterDcs);
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+CUSD:");
  if(str1!=NULL)
  {
    sscanf(str1,"\r\n+CUSD: 0, \"%[^\r]s",Sim80x.Gsm.Msg);    
    tmp_int32_t = strlen(Sim80x.Gsm.Msg);
    if(tmp_int32_t > 5)
    {
      Sim80x.Gsm.Msg[tmp_int32_t-5] = 0;
    }
  }

  //##################################################  
  str1 = strstr(strStart,"\r\n+CREC: ");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.WaveState = (Sim80xWave_t)atoi(str1);
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+CMIC: ");
  if(str1!=NULL)
  {
    while(strchr(str1,'(')!=NULL)
    {
      str1 = strchr(str1,'(');
      str1++;
      tmp_int32_t = atoi(str1);
      switch(tmp_int32_t)
      {
        case 0:
          str1 = strchr(str1,',');
          str1++;
          Sim80x.MicGainMain = atoi(str1);
        break;        
        case 1:
          str1 = strchr(str1,',');
          str1++;
          Sim80x.MicGainAux = atoi(str1);
        break;        
        case 2:
          str1 = strchr(str1,',');
          str1++;
          Sim80x.MicGainMainHandsfree = atoi(str1);
        break;        
        case 3:
          str1 = strchr(str1,',');
          str1++;
          Sim80x.MicGainAuxHandsfree = atoi(str1);
        break;        
      }
    }    
  }  
  //##################################################  
  str1 = strstr(strStart,"\r\n+SNDLEVEL:");
  if(str1!=NULL)
  {
    while(strchr(str1,'(')!=NULL)
    {
      str1 = strchr(str1,'(');
      str1++;
      tmp_int32_t = atoi(str1);
      switch(tmp_int32_t)
      {
        case 0:
          str1 = strchr(str1,',');
          str1++;
          Sim80x.ToneVol = atoi(str1);
        break;        
        case 1:
          str1 = strchr(str1,',');
          str1++;
          // ...        
        break;        
      }
    }
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+ECHO: ");
  if(str1!=NULL)
  {
    sscanf(str1,"\r\n+ECHO: (0,%hu,%hu,%hu,%hu),(1,%hu,%hu,%hu,%hu)",&Sim80x.EchoHandset_NonlinearProcessing,&Sim80x.EchoHandset_AcousticEchoCancellation,&Sim80x.EchoHandset_NoiseReduction,&Sim80x.EchoHandset_NoiseSuppression,\
    &Sim80x.EchoHandfree_NonlinearProcessing,&Sim80x.EchoHandfree_AcousticEchoCancellation,&Sim80x.EchoHandfree_NoiseReduction,&Sim80x.EchoHandfree_NoiseSuppression);
  }  
  //##################################################  
  
  //##################################################  
  
  //##################################################  
  
  //##################################################  
  //##################################################   
  //################################################## 
  #if( _SIM80X_USE_BLUETOOTH==1)  
  //################################################## 
  str1 = strstr(strStart,"\r\n+BTHOST:");
  if(str1!=NULL)
  {
    sscanf(str1,"\r\n+BTHOST: %[^,],%[^\r]",Sim80x.Bluetooth.HostName,Sim80x.Bluetooth.HostAddress);    
  }  
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTSTATUS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.Bluetooth.Status = (BluetoothStatus_t)atoi(str1);
    
    str3 = strstr(str1,"\r\nOK\r\n");
    CheckAnotherConnectedProfile:
    str2 = strstr(str1,"\r\nC:");
    if((str2 != NULL) && (str2 <str3) && (str2 > str1))
    {
      tmp_int32_t = sscanf(str2,"\r\nC: %hhd,%[^,],%[^,],%[^\r]",&Sim80x.Bluetooth.ConnectedID,Sim80x.Bluetooth.ConnectedName,Sim80x.Bluetooth.ConnectedAddress,tmp_str);       
      if(strcmp(tmp_str,"\"HFP\"")==0)
        tmp_int32_t = BluetoothProfile_HSP_HFP;
      else if(strcmp(tmp_str,"\"HSP\"")==0)
        tmp_int32_t = BluetoothProfile_HSP_HFP;
      else if(strcmp(tmp_str,"\"A2DP\"")==0)
        tmp_int32_t = BluetoothProfile_A2DP;
      else if(strcmp(tmp_str,"\"GAP\"")==0)
        tmp_int32_t = BluetoothProfile_GAP;
      else if(strcmp(tmp_str,"\"GOEP\"")==0)
        tmp_int32_t = BluetoothProfile_GOEP;
      else if(strcmp(tmp_str,"\"OPP\"")==0)
        tmp_int32_t = BluetoothProfile_OPP;
      else if(strcmp(tmp_str,"\"SDAP\"")==0)
        tmp_int32_t = BluetoothProfile_SDAP;
      else if(strcmp(tmp_str,"\"SPP\"")==0)
        tmp_int32_t = BluetoothProfile_SSP;
      else tmp_int32_t = BluetoothProfile_NotSet;
    
      for(uint8_t i=0 ;i<sizeof(Sim80x.Bluetooth.ConnectedProfile) ; i++)
      {
        if(Sim80x.Bluetooth.ConnectedProfile[i]==(BluetoothProfile_t)tmp_int32_t)
          break;
        if(Sim80x.Bluetooth.ConnectedProfile[i]==BluetoothProfile_NotSet)
        {
          Sim80x.Bluetooth.ConnectedProfile[i]=(BluetoothProfile_t)tmp_int32_t;
          break;
        }
      }
      str1+=5;
      goto CheckAnotherConnectedProfile;
    }    
  }  
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTPAIRING:");
  if(str1!=NULL)
  {
    Sim80x.Bluetooth.ConnectedID=0;
    memset(Sim80x.Bluetooth.ConnectedAddress,0,sizeof(Sim80x.Bluetooth.ConnectedAddress));
    memset(Sim80x.Bluetooth.ConnectedName,0,sizeof(Sim80x.Bluetooth.ConnectedName));
    tmp_int32_t = sscanf(str1,"\r\n+BTPAIRING: \"%[^\"]\",%[^,],%[^\r]",Sim80x.Bluetooth.ConnectedName,Sim80x.Bluetooth.ConnectedAddress,Sim80x.Bluetooth.PairingPassword);
    if(tmp_int32_t == 3)
      Sim80x.Bluetooth.ConnectedID = 255;      
  }    
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTPAIR:");
  if(str1!=NULL)
  {
    
