labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTCONNECT:");
  if(str1!=NULL)
  {
    Sim80x.Bluetooth.ConnectedID=0;
    memset(Sim80x.Bluetooth.ConnectedAddress,0,sizeof(Sim80x.Bluetooth.ConnectedAddress));
    memset(Sim80x.Bluetooth.ConnectedName,0,sizeof(Sim80x.Bluetooth.ConnectedName));
    tmp_int32_t = sscanf(str1,"\r\n+BTCONNECT: %hhd,\"%[^\"]\",%[^,],%[^\r]",&Sim80x.Bluetooth.ConnectedID,Sim80x.Bluetooth.ConnectedName,Sim80x.Bluetooth.ConnectedAddress,tmp_str);
    if(strcmp(tmp_str,"\"HFP\"")==0)
      tmp_int32_t = BluetoothProfile_HSP_HFP;
    else if(strcmp(tmp_str,"\"HSP\"")==0)
      tmp_int32_t = BluetoothProfile_HSP_HFP;
    else if(strcmp(tmp_str,"\"A2DP\"")==0)
      tmp_int32_t = BluetoothProfile_A2DP;
    else if(strcmp(tmp_str,"\"GAP\"")==0)
      tmp_int32_t = BluetoothProfile_GAP;
    else if(strcmp(tmp_str,"\"GOEP\"")==0)
      tmp_int32_t = BluetoothProfile_GOEP;
    else if(strcmp(tmp_str,"\"OPP\"")==0)
      tmp_int32_t = BluetoothProfile_OPP;
    else if(strcmp(tmp_str,"\"SDAP\"")==0)
      tmp_int32_t = BluetoothProfile_SDAP;
    else if(strcmp(tmp_str,"\"SPP\"")==0)
      tmp_int32_t = BluetoothProfile_SSP;
    else tmp_int32_t = BluetoothProfile_NotSet;
    
    for(uint8_t i=0 ;i<sizeof(Sim80x.Bluetooth.ConnectedProfile) ; i++)
    {
      if(Sim80x.Bluetooth.ConnectedProfile[i]==(BluetoothProfile_t)tmp_int32_t)
        break;
      if(Sim80x.Bluetooth.ConnectedProfile[i]==BluetoothProfile_NotSet)
      {
        Sim80x.Bluetooth.ConnectedProfile[i]=(BluetoothProfile_t)tmp_int32_t;
        break;
      }
    }
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTCONNECTING:");
  if(str1!=NULL)
  {
    memset(tmp_str,0,sizeof(tmp_str));
    str1 = strchr(str1,',');
    str1++;
    str2 = strchr(str1+1,'"');
    str2++;
    strncpy(tmp_str,str1,str2-str1);
    if(strcmp(tmp_str,"\"HFP\"")==0)
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_HSP_HFP;
    else if(strcmp(tmp_str,"\"HSP\"")==0)
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_HSP_HFP;
    else if(strcmp(tmp_str,"\"A2DP\"")==0)
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_A2DP;
    else if(strcmp(tmp_str,"\"GAP\"")==0)
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_GAP;
    else if(strcmp(tmp_str,"\"GOEP\"")==0)
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_GOEP;
    else if(strcmp(tmp_str,"\"OPP\"")==0)
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_OPP;
    else if(strcmp(tmp_str,"\"SDAP\"")==0)
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_SDAP;
    else if(strcmp(tmp_str,"\"SPP\"")==0)
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_SSP;
    else Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_NotSet;
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTDISCONN:");
  if(str1!=NULL)
  {
    Sim80x.Bluetooth.ConnectedID=0;    
    memset(Sim80x.Bluetooth.ConnectedProfile,0,sizeof(Sim80x.Bluetooth.ConnectedProfile));
    memset(Sim80x.Bluetooth.ConnectedAddress,0,sizeof(Sim80x.Bluetooth.ConnectedAddress));
    memset(Sim80x.Bluetooth.ConnectedName,0,sizeof(Sim80x.Bluetooth.ConnectedName));    
    Sim80x.Bluetooth.NeedGetStatus=1;
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTVIS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.Bluetooth.Visibility=atoi(str1);
  }
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTSPPDATA:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,',');
    str1++;
    tmp_int32_t = atoi(str1);
    str1 = strchr(str1,',');
    str1++;
    strncpy(Sim80x.Bluetooth.SPPBuffer,str1,tmp_int32_t);    
    Sim80x.Bluetooth.SPPLen = tmp_int32_t;
  }  
  //##################################################  
  
  //##################################################  
  
  //##################################################  
  
  //##################################################  
  
  
  //##################################################  
  #endif
  //##################################################  
  //##################################################  
  //##################################################
  #if (_SIM80X_USE_GPRS==1)
  //##################################################  
  str1 = strstr(strStart,"\r\n+CGDCONT:");
  if(str1!=NULL)
  {
    
  }  
  //##################################################  
  str1 = strstr(strStart,"\r\n+CGQMIN:");
  if(str1!=NULL)
  {
    
  }    
  //##################################################  
  str1 = strstr(strStart,"\r\n+CGQREQ:");
  if(str1!=NULL)
  {
    
  }    
  //##################################################  
  str1 = strstr(strStart,"\r\n+CGACT:");
  if(str1!=NULL)
  {
    
  }   
  //##################################################  
  str1 = strstr(strStart,"\r\n+CGPADDR:");
  if(str1!=NULL)
  {
    
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\n+CGCLASS:");
  if(str1!=NULL)
  {
    
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\n+CGEREP:");
  if(str1!=NULL)
  {
    
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\n+CGREG:");
  if(str1!=NULL)
  {
    
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\n+CSTT:");
  if(str1!=NULL)
  {
    sscanf(str1,"\r\n+CSTT: \"%[^\"]\",\"%[^\"]\",\"%[^\"]\"\r\n",Sim80x.GPRS.APN,Sim80x.GPRS.APN_UserName,Sim80x.GPRS.APN_Password);    
  }
  //##################################################  
  str1 = strstr(strStart,"AT+CIFSR\r\r\n");
  if(str1!=NULL)
  {
    sscanf(str1,"AT+CIFSR\r\r\n%[^\r]",Sim80x.GPRS.LocalIP);
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\n+CIPMUX:");
  if(str1!=NULL)
  {
    str1 =strchr(str1,':');
    str1++;
    if(atoi(str1)==0)
      Sim80x.GPRS.MultiConnection=0;
    else
      Sim80x.GPRS.MultiConnection=1;
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\nCONNECT OK\r\n");
  if(str1!=NULL)
  {
    if(Sim80x.GPRS.MultiConnection==0)
    {
      Sim80x.GPRS.Connection[0] = GPRSConnection_ConnectOK;      
    }
    else
    {

