labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
    }   
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\nCONNECT FAIL\r\n");
  if(str1!=NULL)
  {
    if(Sim80x.GPRS.MultiConnection==0)
    {
      Sim80x.GPRS.Connection[0] = GPRSConnection_ConnectFail;      
    }
    else
    {

    }   
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\nALREADY CONNECT\r\n");
  if(str1!=NULL)
  {
    if(Sim80x.GPRS.MultiConnection==0)
    {
      Sim80x.GPRS.Connection[0] = GPRSConnection_AlreadyConnect;      
    }
    else
    {

    }   
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\nSEND OK\r\n");
  if(str1!=NULL)
  {
    if(Sim80x.GPRS.MultiConnection==0)
    {
      Sim80x.GPRS.SendStatus[0] = GPRSSendData_SendOK;      
    }
    else
    {

    }   
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\n+HTTPACTION:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.GPRS.HttpAction.Method=(GPRSHttpMethod_t)atoi(str1);
    str1 = strchr(str1,',');
    str1++;
    Sim80x.GPRS.HttpAction.ResultCode = atoi(str1);
    str1 = strchr(str1,',');
    str1++;
    Sim80x.GPRS.HttpAction.DataLen = atoi(str1);    
  } 
  //##################################################  
  str1 = strstr(strStart,"\r\n+HTTPREAD:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.GPRS.HttpAction.TransferDataLen = atoi(str1);
    str1 = strchr(str1,'\n');
    str1++;
    strncpy(Sim80x.GPRS.HttpAction.Data,str1,Sim80x.GPRS.HttpAction.TransferDataLen);
    Sim80x.GPRS.HttpAction.CopyToBuffer=1;
  }
  //##################################################    
  #endif  
  //##################################################  
  //##################################################  
  //##################################################  
  for( uint8_t parameter=0; parameter<11; parameter++)
  {
    if((parameter==10) || (Sim80x.AtCommand.ReceiveAnswer[parameter][0]==0))
    {
      Sim80x.AtCommand.FindAnswer=0;
      break;
    }
    str1 = strstr(strStart,Sim80x.AtCommand.ReceiveAnswer[parameter]);
    if(str1!=NULL)
    {
      Sim80x.AtCommand.FindAnswer = parameter+1;
      //Sim80x.AtCommand.ReceiveAnswerExeTime = HAL_GetTick()-Sim80x.AtCommand.SendCommandStartTime;
      break;
    }    
  }
  //##################################################
  //---       Buffer Process
  //##################################################
  #if (_SIM80X_DEBUG==2)
  printf("%s",strStart);
  #endif
  Sim80x.UsartRxIndex=0;
  memset(Sim80x.UsartRxBuffer,0,_SIM80X_BUFFER_SIZE);    
  Sim80x.Status.Busy=0;
}

/****************************************************************
*FUNCTION NAME:coreRxCallBack
*FUNCTION     :coreRxCallBack
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void	LIB_SIM800C::rxCallBack(void)
{
  if((Sim80x.Status.DataTransferMode==0)&&(Sim80x.UsartRxTemp!=0))
  {
    //Sim80x.UsartRxLastTime = HAL_GetTick();
    Sim80x.UsartRxBuffer[Sim80x.UsartRxIndex] = Sim80x.UsartRxTemp;
    if(Sim80x.UsartRxIndex < (_SIM80X_BUFFER_SIZE-1))
      Sim80x.UsartRxIndex++;
  }
  else if(Sim80x.Status.DataTransferMode==1)
  {
    //Sim80x.UsartRxLastTime = HAL_GetTick();
    Sim80x.UsartRxBuffer[Sim80x.UsartRxIndex] = Sim80x.UsartRxTemp;
    if(Sim80x.UsartRxIndex < (_SIM80X_BUFFER_SIZE-1))
      Sim80x.UsartRxIndex++;
  }
  USART_ITConfig(GSM_USART_CH, USART_IT_RXNE, ENABLE);	
}

/****************************************************************
*FUNCTION NAME:startSim80xTask
*FUNCTION     :startSim80xTask
*INPUT        :argument; 
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::startSim80xTask(void const * argument)
{ 
  uint32_t TimeForSlowRun=0;
  #if( _SIM80X_USE_GPRS==1)
  uint32_t TimeForSlowRunGPRS=0;
  #endif
  uint8_t UnreadMsgCounter=1;
  while(1)
  {    
    //###########################################
    #if( _SIM80X_USE_BLUETOOTH==1)
    //###########################################
    if(Sim80x.Bluetooth.SPPLen >0 )
    {      
      Bluetooth_userNewSppData(Sim80x.Bluetooth.SPPBuffer,Sim80x.Bluetooth.SPPLen);
      Sim80x.Bluetooth.SPPLen=0;
    }
    //###########################################
    if(Sim80x.Bluetooth.NeedGetStatus==1)
    {
      Sim80x.Bluetooth.NeedGetStatus=0;
      Bluetooth_getStatus();
    }    
    //###########################################
    if(Sim80x.Bluetooth.ConnectingRequestProfile != BluetoothProfile_NotSet)
    {
      Bluetooth_userConnectingSpp();
      Sim80x.Bluetooth.ConnectingRequestProfile = BluetoothProfile_NotSet;          
    }
    //###########################################
    if(Sim80x.Bluetooth.ConnectedID==255)
    {
      Sim80x.Bluetooth.ConnectedID=0;
      Bluetooth_userNewPairingRequest(Sim80x.Bluetooth.ConnectedName,Sim80x.Bluetooth.ConnectedAddress,Sim80x.Bluetooth.PairingPassword);      
    }
    //###########################################
    #endif
    //###########################################
    //###########################################
    #if( _SIM80X_USE_GPRS==1)
    //###########################################
    if(HAL_GetTick()-TimeForSlowRunGPRS > 5000)
    {
      
      //TimeForSlowRunGPRS=HAL_GetTick();
    }
    
    
    

    //###########################################
    #endif
    //###########################################
    for(uint8_t i=0 ;i<sizeof(Sim80x.Gsm.HaveNewMsg) ; i++)
    {
      if(Sim80x.Gsm.HaveNewMsg[i] > 0)
      {
        //Gsm_getMsgMemoryStatus();        
        if(Gsm_readMsg(Sim80x.Gsm.HaveNewMsg[i])==true)
        {
					delay_ms(100);
          Gsm_userNewMsg(Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);
					delay_ms(100);
          Gsm_deleteMsg(Sim80x.Gsm.HaveNewMsg[i]);
					delay_ms(100);
        }
        Gsm_getMsgMemoryStatus();  
        Sim80x.Gsm.HaveNewMsg[i]=0;
      }        
    }    
    //###########################################
    if(Sim80x.Gsm.MsgUsed > 0)
    {   
      if(Gsm_readMsg(UnreadMsgCounter)==true)
      {
        Gsm_userNewMsg(Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);
        Gsm_deleteMsg(UnreadMsgCounter);
        Gsm_getMsgMemoryStatus();
      }
      UnreadMsgCounter++;
      if(UnreadMsgCounter==150)
        UnreadMsgCounter=0;      
    }
    //###########################################
    if(Sim80x.Gsm.HaveNewCall == 1)
    {
      Sim80x.Gsm.GsmVoiceStatus = GsmVoiceStatus_Ringing;
      Sim80x.Gsm.HaveNewCall = 0;
      Gsm_userNewCall(Sim80x.Gsm.CallerNumber);     
    }    
    //###########################################
    //if(HAL_GetTick() - TimeForSlowRun > 20000)
    {
      sim800c.sendAtCommand("AT+CSQ\r\n",200,1,"\r\n+CSQ:");  
      sim800c.sendAtCommand("AT+CBC\r\n",200,1,"\r\n+CBC:"); 
      sim800c.sendAtCommand("AT+CREG?\r\n",200,1,"\r\n+CREG:");  
      Gsm_getMsgMemoryStatus();      
      //TimeForSlowRun=HAL_GetTick();
    }
    //###########################################
    //Gsm_User(HAL_GetTick());
    //###########################################
    delay_ms(100);
    
