labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  }    
}

/****************************************************************
*FUNCTION NAME:initValue
*FUNCTION     :initValue
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::initValue(void)
{
  sim800c.sendAtCommand("ATE1\r\n",200,1,"ATE1\r\r\nOK\r\n");
  sim800c.sendAtCommand("AT+COLP=1\r\n",200,1,"AT+COLP=1\r\r\nOK\r\n");
  sim800c.sendAtCommand("AT+CLIP=1\r\n",200,1,"AT+CLIP=1\r\r\nOK\r\n");
  sim800c.sendAtCommand("AT+FSHEX=0\r\n",200,1,"AT+FSHEX=0\r\r\nOK\r\n");
  sim800c.sendAtCommand("AT+CREG=1\r\n",200,1,"AT+CREG=1\r\r\nOK\r\n");
  sim800c.sendAtCommand("AT+ECHO?\r\n",200,1,"\r\nOK\r\n");
  Gsm_setMsgMemoryLocation(GsmMsgMemory_OnModule);
  Gsm_setMsgFormat(GsmMsgFormat_Text);
  Gsm_setMsgTextModeParameter(17,167,0,0);
  Gsm_getMsgCharacterFormat();
  Gsm_getMsgFormat();
  if(Sim80x.Gsm.MsgFormat != GsmMsgFormat_Text)
    Gsm_setMsgFormat(GsmMsgFormat_Text);
  Gsm_getMsgServiceNumber();
  Gsm_getMsgTextModeParameter();
  getIMEI(NULL);
  getLoadVol();
  getRingVol();
  getMicGain();
  getToneVol();
    #if (_SIM80X_USE_BLUETOOTH==1)
    Bluetooth_setAutoPair(true);
    #endif
  sim800c.sendAtCommand("AT+CREG?\r\n",200,1,"\r\n+CREG:");  
  //coreUserInit();
}

/****************************************************************
*FUNCTION NAME:init
*FUNCTION     :init
*INPUT        :Priority : osPriority 
*OUTPUT       :void
****************************************************************/
void	LIB_SIM800C::init(osPriority Priority)
{
  #if (_SIM80X_USE_POWER_KEY==1)  
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
  #else
  delay_ms(1000);
  #endif
  
  memset(&Sim80x,0,sizeof(Sim80x));
  memset(Sim80x.UsartRxBuffer,0,_SIM80X_BUFFER_SIZE);
  USART_ITConfig(GSM_USART_CH, USART_IT_RXNE, ENABLE);	
        
  //osThreadDef(Sim80xTask, startSim80xTask, Priority, 0, 256);         //RTOS
  //Sim80xTaskHandle = osThreadCreate(osThread(Sim80xTask), NULL);        //RTOS
  //osThreadDef(Sim80xBuffTask, startSim80xBuffTask, Priority, 0, 256);   //RTOS
  //Sim80xBuffTaskHandle = osThreadCreate(osThread(Sim80xBuffTask), NULL);        //RTOS
        
  for(uint8_t i=0 ;i<10 ;i++)  
  {
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
      break;
    delay_ms(200);
  }  
  
  setPower(true); 
}

/****************************************************************
*FUNCTION NAME:saveParameters
*FUNCTION     :saveParameters
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void   LIB_SIM800C::saveParameters(void)
{
  sim800c.sendAtCommand("AT&W\r\n",1000,1,"AT&W\r\r\nOK\r\n");
  #if (_SIM80X_DEBUG==1)
  printf("\r\nSim80x_SaveParameters() ---> OK\r\n");
  #endif
}

/****************************************************************
*FUNCTION NAME:setPower
*FUNCTION     :setPower
*INPUT        :TurnOn
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::setPower(bool TurnOn)
{ 
  if(TurnOn==true)
  {  
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
    {
      delay_ms(100);
      #if (_SIM80X_DEBUG==1)
      printf("\r\nSim80x_SetPower(ON) ---> OK\r\n");
      #endif
      Sim80x.Status.Power=1;
      initValue();
    }
    else
    {     
      #if (_SIM80X_USE_POWER_KEY==1)  
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_RESET);
      delay_ms(1200);
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
      #endif
      delay_ms(3000);  
      if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
      {
        delay_ms(10000);
        #if (_SIM80X_DEBUG==1)
        printf("\r\nSim80x_SetPower(ON) ---> OK\r\n");
        #endif
        Sim80x.Status.Power=1;
        initValue();   
      }
      else
        Sim80x.Status.Power=0;
    }
  }
  else
  {
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
    {
      #if (_SIM80X_DEBUG==1)
      printf("\r\nSim80x_SetPower(OFF) ---> OK\r\n");
      #endif
      Sim80x.Status.Power=0;
      #if (_SIM80X_USE_POWER_KEY==1) 
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_RESET);
      delay_ms(1200);
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
      #endif
      #if (_SIM80X_USE_POWER_KEY==0)
      sim800c.sendAtCommand("AT+CPOWD=1\r\n",2000,1,"\r\nOK\r\n"); 
      #endif      
    }
  }  
}

/****************************************************************
*FUNCTION NAME:setFactoryDefault
*FUNCTION     :setFactoryDefault
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setFactoryDefault(void)
{
  sim800c.sendAtCommand("AT&F0\r\n",200,0);

  debugTerminal("Sim80x_setFactoryDefault");

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 

}

/****************************************************************
*FUNCTION NAME:setBaudRate
*FUNCTION     :setBaudRate
*INPUT        :baudrate
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setBaudRate(uint16_t baudrate)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+IPR=%d\r\n", baudrate); 
  sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setBaudRate");

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 
}

/****************************************************************
*FUNCTION NAME:setAtEcho
*FUNCTION     :setAtEcho
*INPUT        :turnon
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setAtEcho(bool turnon)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "ATE%d\r\n", turnon); 
  sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setAtEcho");

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 

}

/****************************************************************
*FUNCTION NAME:getIMEI
*FUNCTION     :getIMEI
*INPUT        :IMEI
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::getIMEI(char *IMEI)
{
  char      *strStart,*str1;

  sim800c.sendAtCommand("AT+CGSN\r\n",200, 0);

  // Read & Update Operation
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+CGSN\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+CGSN\r\r\n%s",Sim80x.IMEI);    

