labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  debugTerminal("Sim80x_getIMEI");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
}

/****************************************************************
*FUNCTION NAME:getRingVol
*FUNCTION     :getRingVol
*INPUT        :void
*OUTPUT       :uint8_t
****************************************************************/
uint8_t  LIB_SIM800C::getRingVol(void)
{
  uint8_t answer;
  answer=sim800c.sendAtCommand("AT+CRSL?\r\n",1000,2,"\r\nOK\r\n","\r\n+CME ERROR:");
  
  if(answer==1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_GetRingVol(%d) <--- OK\r\n",Sim80x.RingVol);
    #endif    
    return Sim80x.RingVol;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_GetRingVol() <--- ERROR\r\n");
    #endif    
    return 0;
  }
}

/****************************************************************
*FUNCTION NAME:setRingVol
*FUNCTION     :setRingVol
*INPUT        :Vol_0_to_100
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::setRingVol(uint8_t Vol_0_to_100)
{
  uint8_t answer;
  char str[16];
  snprintf(str,sizeof(str),"AT+CRSL=%d\r\n",Vol_0_to_100);
  answer=sim800c.sendAtCommand(str,1000,2,"\r\nOK\r\n","\r\n+CME ERROR:");
  if(answer==1)
  {
    Sim80x.RingVol=Vol_0_to_100;
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetRingVol(%d) ---> OK\r\n",Sim80x.RingVol);
    #endif    
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetRingVol(%d) ---> ERROR\r\n",Sim80x.RingVol);
    #endif    
    return false;
  }
}

/****************************************************************
*FUNCTION NAME:getLoadVol
*FUNCTION     :getLoadVol
*INPUT        :void
*OUTPUT       :uint8_t
****************************************************************/
uint8_t  LIB_SIM800C::getLoadVol(void)
{
  uint8_t answer;
  answer=sim800c.sendAtCommand("AT+CLVL?\r\n",1000,2,"\r\nOK\r\n","\r\n+CME ERROR:");
  if(answer==1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_GetLoadVol(%d) <--- OK\r\n",Sim80x.LoadVol);
    #endif    
    return Sim80x.LoadVol;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_GetLoaStartSim80xTaskdVol() <--- ERROR\r\n");
    #endif      
    return 0;  
  }
}

/****************************************************************
*FUNCTION NAME:getLoadVol
*FUNCTION     :getLoadVol
*INPUT        :Vol_0_to_100
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::setLoadVol(uint8_t Vol_0_to_100)
{
  uint8_t answer;
  char str[16];
  snprintf(str,sizeof(str),"AT+CLVL=%d\r\n",Vol_0_to_100);
  answer=sim800c.sendAtCommand(str,1000,2,"\r\nOK\r\n","\r\n+CME ERROR:");
  if(answer==1)
  {
    Sim80x.LoadVol=Vol_0_to_100;
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetLoadVol(%d) ---> OK\r\n",Sim80x.LoadVol);
    #endif    
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetLoadVol(%d) ---> ERROR\r\n",Sim80x.LoadVol);
    #endif 
    return false;
  }
}

/****************************************************************
*FUNCTION NAME:waveGetState
*FUNCTION     :waveGetState
*INPUT        :void
*OUTPUT       :Wave status //ask bharath
****************************************************************/
Sim80xWave_t   LIB_SIM800C::waveGetState(void)
{
  sim800c.sendAtCommand("AT+CREC?\r\n",1000,1,"\r\n+CREC:");
  #if (_SIM80X_DEBUG==1)
  printf("\r\nSim80x_WaveGetState(%d) ---> OK\r\n",Sim80x.WaveState);
  #endif   
  return Sim80x.WaveState;
}

/****************************************************************
*FUNCTION NAME:waveRecord
*FUNCTION     :waveRecord
*INPUT        :ID,TimeLimitInSecond
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::waveRecord(uint8_t ID,uint8_t TimeLimitInSecond)
{
  uint8_t answer;
  char str[32];
  snprintf(str,sizeof(str),"AT+CREC=1,\"C:\\User\\%d.amr\",0,%d\r\n",ID,TimeLimitInSecond);
  answer = sim800c.sendAtCommand(str,3000,1,"\r\nOK\r\n");
  if(answer == 1)
  {
    Sim80x.WaveState = Sim80xWave_Recording;
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_WaveRecord(Recording) ---> OK\r\n");
    #endif     
    return true;
  }
  else
  {
    Sim80x.WaveState = Sim80xWave_Idle;
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_WaveRecord(Recording) ---> ERROR\r\n");
    #endif     
    return false;
  }  
}

/****************************************************************
*FUNCTION NAME:wavePlay
*FUNCTION     :wavePlay
*INPUT        :ID
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::wavePlay(uint8_t ID)
{
  uint8_t answer;
  char str[64];
  snprintf(str,sizeof(str),"AT+CREC=4,\"C:\\User\\%d.amr\",0,%d\r\n",ID,Sim80x.LoadVol);
  answer = sim800c.sendAtCommand(str,3000,1,"\r\nOK\r\n");
  if(answer == 1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_WavePlay() ---> OK\r\n");
    #endif     
    Sim80x.WaveState = Sim80xWave_Playing;
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_WavePlay() ---> ERROR\r\n");
    #endif     
    Sim80x.WaveState = Sim80xWave_Idle;
    return false;
  }   
}

/****************************************************************
*FUNCTION NAME:waveStop
*FUNCTION     :waveStop
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::waveStop(void)
{
  uint8_t answer;
  answer = sim800c.sendAtCommand("AT+CREC=5\r\n",1000,2,"\r\nOK\r\n","\r\nERROR\r\n");
  if(answer == 1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_WaveStop() ---> OK\r\n");
    #endif     
    Sim80x.WaveState = Sim80xWave_Idle;
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_WaveStop() ---> ERROR\r\n");
    #endif     
    return false;
  }   
}

/****************************************************************
*FUNCTION NAME:waveDelete
*FUNCTION     :waveDelete
*INPUT        :ID
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::waveDelete(uint8_t ID)
{
  uint8_t answer;
  char str[32];
  snprintf(str,sizeof(str),"AT+CREC=3,\"C:\\User\\%d.amr\"\r\n",ID);
  answer = sim800c.sendAtCommand(str,1000,1,"\r\nOK\r\n");
  if(answer == 1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_WaveDelete(%d.amr) ---> OK\r\n",ID);
    #endif     
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_WaveDelete(%d.amr) ---> ERROR\r\n",ID);          
    //printf("\r\nSim80x_WaveDelete(%d.amr) ---> ERROR\r\n",ID_1_to_20);          
    #endif     
    return false;
  }
}

/****************************************************************
*FUNCTION NAME:setMicGain
*FUNCTION     :setMicGain
*INPUT        :Channel_0_to_4,Gain_0_to_15; 
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::setMicGain(uint8_t Channel_0_to_4,uint8_t Gain_0_to_15)
{
   uint8_t answer;
  char str[32];
  snprintf(str,sizeof(str),"AT+CMIC=%d,%d\r\n",Channel_0_to_4,Gain_0_to_15);
  answer = sim800c.sendAtCommand(str,1000,1,"\r\nOK\r\n");
  if(answer == 1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetMicGain(%d,%d) ---> OK\r\n",Channel_0_to_4,Gain_0_to_15);
    #endif  
    getMicGain();    
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetMicGain(%d,%d) ---> ERROR\r\n",Channel_0_to_4,Gain_0_to_15);
    #endif     
    return false;
  }  
}

/****************************************************************
*FUNCTION NAME:getMicGain
*FUNCTION     :getMicGain
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getMicGain(void)
{
  uint8_t answer;
  answer=sim800c.sendAtCommand("AT+CMIC?\r\n",1000,2,"\r\nOK\r\n","\r\n+CME ERROR:");
  if(answer==1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_GetMicGain(%d,%d,%d,%d) <--- OK\r\n",Sim80x.MicGainMain,Sim80x.MicGainAux,Sim80x.MicGainMainHandsfree,Sim80x.MicGainAuxHandsfree);   
    #endif    
    return Sim80x.LoadVol;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_GetMicGain() <--- ERROR\r\n");
    #endif      
    return 0;  
  }  
}

/****************************************************************
*FUNCTION NAME:tonePlay
*FUNCTION     :tonePlay
*INPUT        :Sim80xTone, Time_ms
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::tonePlay(Sim80xTone_t Sim80xTone,uint32_t  Time_ms)
{
  uint8_t answer;
  char str[32];
  snprintf(str,sizeof(str),"AT+STTONE=1,%d,%d\r\n",Sim80xTone,Time_ms);
  answer = sim800c.sendAtCommand(str,1000,2,"\r\nOK\r\n","\r\n+CME ERROR\r\n");
  if(answer == 1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_TonePlay(%d,%d) ---> OK\r\n",Sim80xTone,Time_ms);
    #endif     
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_TonePlay() ---> ERROR\r\n");
    #endif     
    return false;
  }     
}

/****************************************************************
*FUNCTION NAME:toneStop
*FUNCTION     :toneStop
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::toneStop(void)
{
  uint8_t answer;
  answer=sim800c.sendAtCommand("AT+STTONE=0\r\n",1000,2,"\r\nOK\r\n","\r\n+CME ERROR:");
  if(answer==1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_ToneStop() <--- OK\r\n"); 
    #endif    
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_ToneStop() <--- ERROR\r\n");
    #endif      
    return false;  
  }  
}

/****************************************************************
*FUNCTION NAME:getToneVol
*FUNCTION     :getToneVol
*INPUT        :void
*OUTPUT       :uint8_t
****************************************************************/
uint8_t LIB_SIM800C::getToneVol(void)
{
  uint8_t answer;
  answer=sim800c.sendAtCommand("AT+SNDLEVEL?\r\n",1000,2,"\r\nOK\r\n","\r\n+CME ERROR:");
  if(answer==1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_GetToneVol(%d) <--- OK\r\n",Sim80x.ToneVol);   
    #endif    
    return Sim80x.ToneVol;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_GetToneVol() <--- ERROR\r\n");
    #endif      
    return 0;  
  }  
  
