labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
}

/****************************************************************
*FUNCTION NAME:setToneVol
*FUNCTION     :setToneVol
*INPUT        :Vol_0_to_100; 
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::setToneVol(uint8_t Vol_0_to_100)
{
  uint8_t answer;
  char str[32];
  snprintf(str,sizeof(str),"AT+SNDLEVEL=0,%d\r\n",Vol_0_to_100);
  answer = sim800c.sendAtCommand(str,1000,2,"\r\nOK\r\n","\r\n+CME ERROR\r\n");
  if(answer == 1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetToneVol(%d) ---> OK\r\n",Vol_0_to_100);
    #endif 
    getToneVol();    
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetToneVol(%d) ---> ERROR\r\n",Vol_0_to_100);
    #endif     
    return false;
  }     
  
}

/****************************************************************
*FUNCTION NAME:setRingTone
*FUNCTION     :setRingTone
*INPUT        :Tone_0_to_19,Save; 
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::setRingTone(uint8_t Tone_0_to_19,bool Save)
{
  uint8_t answer;
  char str[32];
  snprintf(str,sizeof(str),"AT+CALS=%d\r\n",Tone_0_to_19);
  answer = sim800c.sendAtCommand(str,1000,2,"\r\nOK\r\n","\r\n+CME ERROR\r\n");
  if(answer == 1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetRingTone(%d) ---> OK\r\n",Tone_0_to_19);
    #endif    
    if(Save==true)
      saveParameters();
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetRingTone(%d) ---> ERROR\r\n",Tone_0_to_19);
    #endif     
    return false;
  }       
} 

/****************************************************************
*FUNCTION NAME:setEchoParameters
*FUNCTION     :setEchoParameters
*INPUT        :SelectMic_0_or_1,NonlinearProcessingRemove,AcousticEchoCancellation, NoiseReduction, NoiseSuppression; 
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::setEchoParameters(uint8_t  SelectMic_0_or_1,uint16_t NonlinearProcessingRemove,
uint16_t AcousticEchoCancellation,uint16_t NoiseReduction,uint16_t NoiseSuppression)
{
  uint8_t answer;
  char str[64];
  snprintf(str,sizeof(str),"AT+ECHO=%d,%d,%d,%d,%d,1\r\n",SelectMic_0_or_1,NonlinearProcessingRemove,AcousticEchoCancellation,NoiseReduction,NoiseSuppression);
  answer = sim800c.sendAtCommand(str,1000,2,"\r\nOK\r\n","\r\n+CME ERROR\r\n");
  if(answer == 1)
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetEchoParameters() ---> OK\r\n");
    #endif   
    sim800c.sendAtCommand("AT+ECHO?\r\n",200,1,"\r\nOK\r\n");    
    return true;
  }
  else
  {
    #if (_SIM80X_DEBUG==1)
    printf("\r\nSim80x_SetEchoParameters() ---> ERROR\r\n");
    #endif     
    sim800c.sendAtCommand("AT+ECHO?\r\n",200,1,"\r\nOK\r\n");
    return false;
  }         
}

/****************************************************************
*FUNCTION NAME:GSM_IRQHandler
*FUNCTION     :GSM_IRQHandler
*INPUT        :USARTx,UsartRxTemp,state; //refer defines in header file
*OUTPUT       :none
****************************************************************/
//#pragma vector = USART_VECTOR
GSM_IRQHANDLER {
  
  //Sim80x.UsartRxBuffer[index] = USART_ReceiveData(GSM_USART_CH);
  //index++;
  USART_ClearITPendingBit(GSM_USART_CH, USART_IT_RXNE);

  USART_ClearFlag(GSM_USART_CH, USART_FLAG_RXNE);
}

#endif

#endif
